Revit 2027 API
PointCloudOverrides.GetPointCloudRegionOverrideSettings(ElementId, String, Document) Method
 Gets override settings assigned to a particular region within a PointCloudInstance element.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudOverrideSettings GetPointCloudRegionOverrideSettings(
	ElementId elementId,
	string regionTag,
	Document doc
)
Public Function GetPointCloudRegionOverrideSettings (
	elementId As ElementId,
	regionTag As String,
	doc As Document
) As PointCloudOverrideSettings
public:
PointCloudOverrideSettings^ GetPointCloudRegionOverrideSettings(
	ElementId^ elementId,
	String^ regionTag,
	Document^ doc
)
member GetPointCloudRegionOverrideSettings :
        elementId : ElementId *
        regionTag : string *
        doc : Document -> PointCloudOverrideSettings
Parameters
elementId ElementId
 Id of the overridden element.
regionTag String
 The tag identifying the particular region within the PointCloudInstance element. Tags can be obtained from PointCloudInstance via method getRegions.
doc Document
 Document containing the overridden element.
Return Value
PointCloudOverrideSettings
 The override settings assigned to the region, if present, or a default override settings if nothing was found.
Exceptions
Exception | Condition
ArgumentException |  Thrown when supplied regionTag is not empty while doc is NULL
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrides Class
GetPointCloudRegionOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace